#include <iostream>
using namespace std;

//  1. Дан масив чисел розмірністю 10 елементів. Написа-
//  ти функцію, яка сортує масив за зростанням або за
//  спаданням, залежно від третього параметра функції.
//  Якщо він дорівнює 1, сортування йде за спаданням,
//  якщо 0, то за зростанням.Перші 2 параметри функ -
//  ції — це масив і його розмір, третій параметр за за -
//  мовчуванням дорівнює 1.





//  2. Дан масив випадкових чисел у діапазоні від - 20 до
//  + 20. Необхідно знайти позиції крайніх від'ємних еле-
//  ментів(найлівішого від'ємного елемента і найправі-
//  шого від'ємного елемента) і впорядкувати елементи,
//  що знаходяться між ними.


int main()
{
    srand(time(0));
    cout << "Hello World!" << endl;
}
