#include <iostream>
using namespace std;


// 1.Вводиться рядок.Яких букв у рядку більше ’а’ чи ’о’ ?
// 2.Вводиться рядок.Порахувати кількість латинських букв, цифр та пробілів у рядку.
// 3.Дано рядок.Замінити у рядку всі великі букви на малі і навпаки.
// 4.Написати функцію, яка отримує рядок і повертає довжину рядка.
// Без використання функції strlen()


// На додаткові 12 балів
// 5 ***.Дано рядок.Видалити із рядка заданий символ.Результат розмістити у новому рядку.
// 6 ***.Розробити програму, яка зчитує з екрану рядок, а потім видає статистику :
// кількість пробільних символів(whitespaces), голосних, приголосних, знаків пунктуації.
// Введення передбачається англомовним.
// Hello
// Helo




int main()
{

}