#include <iostream>
#include <windows.h>
using namespace std;

struct Пральна_машинка {
    char фірма[15];
    char колір[20];
    int ширина;
    int довжина;
    int висота;
    int потужність;
    int швидкість_віджиму;
    int температура_нагріву;
};

struct Праска {
    char фірма[15];
    char модель[20];
    char колір[20];
    int мінімальна_температура;
    int максимальна_температура;
    bool подача_пари;
    int потужність;
};

struct Бойлер {
    char фірма[15];
    char колір[20];
    int потужність;
    int обсяг;
    int температура_нагріву;
};




int main()
{
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);
    /*
    Завдання 1. Реалізувати структуру «Пральна машинка»
    (фірма, колір, ширина, довжина, висота, потужність, швид -
    кість віджиму, температура нагріву).Створіть екземпляр
    структури і проілюструйте роботу з ним(і мейні створити
    об * єкт, задати значення для всіх полів, вивести на екран.)

    Пральна_машинка Пральни_Машина_1;
    Пральни_Машина_1 = { "Bosch", "Червоний", 200, 180, 180, 1700, 950, 90 };

    cout << "Фірма: ";
    for (int i = 0; i < sizeof(Пральни_Машина_1.фірма); i++)
        cout << Пральни_Машина_1.фірма[i];
    cout << endl << "Колір: ";
    for (int i = 0; i < sizeof(Пральни_Машина_1.колір); i++)
        cout << Пральни_Машина_1.колір[i];
    
    cout << endl << "Ширина: " << Пральни_Машина_1.ширина << "Cm." << endl;
    cout << "Довжина: " << Пральни_Машина_1.довжина << "Cm." << endl;
    cout << "Висота: " << Пральни_Машина_1.висота << "Cm." << endl;
    cout << "Потужність: " << Пральни_Машина_1.потужність << " Вт." << endl;
    cout << "Швидкість_віджиму: " << Пральни_Машина_1.швидкість_віджиму << "Об./Мін." << endl;
    cout << "Температура_нагріву: " << Пральни_Машина_1.температура_нагріву << "°C" << endl;
    */

    /*
    Завдання 2. Реалізувати структуру «Праска»(фірма,
    модель, колір, мінімальна температура, максимальна
    температура, подача пари так / ні, потужність).Створіть
    екземпляр структури і проілюструйте роботу з ним.

    Праска праска1;
    праска1 = { "Philips", "DST3010", "Фіолетовий", 75, 210, true, 2000 };

    cout << "Фірма: ";
    for (int i = 0; i < sizeof(праска1.фірма); i++)
        cout << праска1.фірма[i];
    cout << endl << "Модель: ";
    for (int i = 0; i < sizeof(праска1.модель); i++)
        cout << праска1.модель[i];
    cout << endl << "Колір: ";
    for (int i = 0; i < sizeof(праска1.колір); i++)
        cout << праска1.колір[i];

    cout << endl << "Мінімальна_температура: " << праска1.мінімальна_температура << "°C" << endl;
    cout << "Максимальна_температура: " << праска1.максимальна_температура << "°C" << endl;
    cout << "Подача_пари: ";
    if (праска1.подача_пари) cout << "Так";
    else cout << "Ні";
    cout << endl << "Потужність: " << праска1.потужність << " Вт." << endl;
    */

    /*
    Завдання 3. Реалізувати структуру «Бойлер»(фірма,
    колір, потужність, обсяг, температура нагріву).Створіть
    екземпляр структури і проілюструйте роботу з ним.

    Бойлер бойлер1;
    бойлер1 = { "Ariston", "Білий", 1500, 80, 75};

    cout << "Фірма: ";
    for (int i = 0; i < sizeof(бойлер1.фірма); i++)
        cout << бойлер1.фірма[i];
    cout << endl << "Колір: ";
    for (int i = 0; i < sizeof(бойлер1.колір); i++)
        cout << бойлер1.колір[i];

    cout << endl << "Потужність: " << бойлер1.потужність << " Вт." << endl;
    cout << "Обсяг: " << бойлер1.потужність << " Вт." << endl;
    cout << "Температура_нагріву: " << бойлер1.температура_нагріву << "°C" << endl;
    */



    // Додаткове завдання на додаткові 12 балів

    /*
    Завдання 4
    Реалізувати структуру "Машина" (колір, модель, номер).Номер машини може бути
    або п'ятизначним номером, або словом до 8 символів.
    Рекомендації: номер реалізувати як об'єднання.
    Створити екземпляр структури "Машина" і реалізувати для нього такі функції :
    Заповнення машини;
    Друк машини.
    Створити масив із 10 екземплярів структури "Машина" і реалізувати для нього такі функції :
    Редагувати машину;
    Друк усіх машин;
    Пошук машини за номером.
    */
}
