#include <iostream>
#include <windows.h>
using namespace std;

struct Пральна_машинка {
    char фірма[15];
    char колір[20];
    int ширина;
    int довжина;
    int висота;
    int потужність;
    int швидкість_віджиму;
    int температура_нагріву;
};

struct Праска {
    char фірма[15];
    char модель[20];
    char колір[20];
    int мінімальна_температура;
    int максимальна_температура;
    bool подача_пари;
    int потужність;
};

struct Бойлер {
    char фірма[15];
    char колір[20];
    int потужність;
    int обсяг;
    int температура_нагріву;
};

// Сказав Chat GPT, що в завданні написано використовувати обєднання
union Номер {
    int номер;
    char слово[9];
};
struct Машина {
    char колір[20];
    char модель[20];
    Номер номер;
    int тип_номера;
};

void Заповнення_машини(Машина& машина) {
    int вибір;
    cout << "Введіть колір: ";cin >> машина.колір;
    cout << "Введіть модель: ";cin >> машина.модель;
    
    cout << "1. Числовий номер" << endl;
    cout << "2. Словесний" << endl;
    cout << "Ваш вибір (1/2): "; cin >> вибір;
    if (вибір == 1) {
        cout << "Введіть номер: ";
        cin >> машина.номер.номер;
        машина.тип_номера = вибір;
    }
    else if (вибір == 2) {
        cout << "Введіть слово: ";
        cin >> машина.номер.слово;
        машина.тип_номера = вибір;
    }
}
void Друк_машини(Машина& машина) {
    cout << "Колір: " << машина.колір << endl;
    cout << "Модель: " << машина.модель << endl;

    if (машина.тип_номера == 1)
        cout << "Ваш номер: " << машина.номер.номер << endl;
    else if (машина.тип_номера == 2) {
        cout << "Ваш номер: " << машина.номер.слово << endl;
    }
}

void Друк_усіх_машин(Машина машини[]) {
    for (int i = 0; i < 10; i++) {
        cout << endl << "Машина " << i + 1 << endl;
        Друк_машини(машини[i]);
    }
}
void Редагувати_машину(Машина машини[]) {
    int номер;
    cout << "Введіть номер машини в списку (1-10): "; cin >> номер;
    Заповнення_машини(машини[номер - 1]);
}

bool Порівняти(char a[], char b[]) {
    int i = 0;

    while (a[i] != '\0' || b[i] != '\0') {
        if (a[i] != b[i]) return false;
        i++;
    }

    return true;
}
void Пошук_за_номером(Машина машини[]) {
    int вибір;
    cout << "1. Числовий номер\n2. Словесний номер\n";
    cin >> вибір;

    if (вибір == 1) {
        int номер;
        cout << "Введіть номер: ";
        cin >> номер;

        for (int i = 0; i < 10; i++) {
            if (машини[i].тип_номера == 1 && машини[i].номер.номер == номер)
                Друк_машини(машини[i]);
        }
    }
    else if (вибір == 2) {
        char слово[9];
        cout << "Введіть номер: ";
        cin >> слово;

        for (int i = 0; i < 10; i++) {
            if (машини[i].тип_номера == 2 && Порівняти(машини[i].номер.слово, слово))
                Друк_машини(машини[i]);
        }
    }
}

int main()
{
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);
    /*
    Завдання 1. Реалізувати структуру «Пральна машинка»
    (фірма, колір, ширина, довжина, висота, потужність, швид -
    кість віджиму, температура нагріву).Створіть екземпляр
    структури і проілюструйте роботу з ним(і мейні створити
    об * єкт, задати значення для всіх полів, вивести на екран.)
    */
    cout << endl << "Пральна машинка: ";
    Пральна_машинка Пральни_Машина_1;
    Пральни_Машина_1 = { "Bosch", "Червоний", 200, 180, 180, 1700, 950, 90 };

    cout << "Фірма: ";
    for (int i = 0; i < sizeof(Пральни_Машина_1.фірма); i++)
        cout << Пральни_Машина_1.фірма[i];
    cout << endl << "Колір: ";
    for (int i = 0; i < sizeof(Пральни_Машина_1.колір); i++)
        cout << Пральни_Машина_1.колір[i];
    
    cout << endl << "Ширина: " << Пральни_Машина_1.ширина << "Cm." << endl;
    cout << "Довжина: " << Пральни_Машина_1.довжина << "Cm." << endl;
    cout << "Висота: " << Пральни_Машина_1.висота << "Cm." << endl;
    cout << "Потужність: " << Пральни_Машина_1.потужність << " Вт." << endl;
    cout << "Швидкість_віджиму: " << Пральни_Машина_1.швидкість_віджиму << "Об./Мін." << endl;
    cout << "Температура_нагріву: " << Пральни_Машина_1.температура_нагріву << "°C" << endl;
    cout << endl;

    /*
    Завдання 2. Реалізувати структуру «Праска»(фірма,
    модель, колір, мінімальна температура, максимальна
    температура, подача пари так / ні, потужність).Створіть
    екземпляр структури і проілюструйте роботу з ним.
    */
    cout << endl << "Праска: ";
    Праска праска1;
    праска1 = { "Philips", "DST3010", "Фіолетовий", 75, 210, true, 2000 };

    cout << "Фірма: ";
    for (int i = 0; i < sizeof(праска1.фірма); i++)
        cout << праска1.фірма[i];
    cout << endl << "Модель: ";
    for (int i = 0; i < sizeof(праска1.модель); i++)
        cout << праска1.модель[i];
    cout << endl << "Колір: ";
    for (int i = 0; i < sizeof(праска1.колір); i++)
        cout << праска1.колір[i];

    cout << endl << "Мінімальна_температура: " << праска1.мінімальна_температура << "°C" << endl;
    cout << "Максимальна_температура: " << праска1.максимальна_температура << "°C" << endl;
    cout << "Подача_пари: ";
    if (праска1.подача_пари) cout << "Так";
    else cout << "Ні";
    cout << endl << "Потужність: " << праска1.потужність << " Вт." << endl;
    cout << endl;

    /*
    Завдання 3. Реалізувати структуру «Бойлер»(фірма,
    колір, потужність, обсяг, температура нагріву).Створіть
    екземпляр структури і проілюструйте роботу з ним.
    */
    cout << endl << "Бойлер: ";
    Бойлер бойлер1;
    бойлер1 = { "Ariston", "Білий", 1500, 80, 75};

    cout << "Фірма: ";
    for (int i = 0; i < sizeof(бойлер1.фірма); i++)
        cout << бойлер1.фірма[i];
    cout << endl << "Колір: ";
    for (int i = 0; i < sizeof(бойлер1.колір); i++)
        cout << бойлер1.колір[i];

    cout << endl << "Потужність: " << бойлер1.потужність << " Вт." << endl;
    cout << "Обсяг: " << бойлер1.обсяг << " Л." << endl;
    cout << "Температура_нагріву: " << бойлер1.температура_нагріву << "°C" << endl;
    cout << endl;


    // Додаткове завдання на додаткові 12 балів
    /*
    Завдання 4
    Реалізувати структуру "Машина" (колір, модель, номер).Номер машини може бути
    або п'ятизначним номером, або словом до 8 символів.
    Рекомендації: номер реалізувати як об'єднання.
    Створити екземпляр структури "Машина" і реалізувати для нього такі функції :
    Заповнення машини;
    Друк машини.
    Створити масив із 10 екземплярів структури "Машина" і реалізувати для нього такі функції :
    Редагувати машину;
    Друк усіх машин;
    Пошук машини за номером.
    */

    Машина машина1;
    
    Заповнення_машини(машина1);
    cout << endl;
    Друк_машини(машина1);
    

    Машина* машини = new Машина[10];
    for (int i = 0; i < 10; i++)
        машини[i] = {};

    Редагувати_машину(машини);
    cout << endl;
    Друк_усіх_машин(машини);
    cout << endl;
    Пошук_за_номером(машини);
    cout << endl;


    delete[] машини;
}