#include <iostream>
using namespace std;

struct Пральна_машинка {
    
};








int main()
{
    /*
    Завдання 1. Реалізувати структуру «Пральна машинка»
    (фірма, колір, ширина, довжина, висота, потужність, швид -
    кість віджиму, температура нагріву).Створіть екземпляр
    структури і проілюструйте роботу з ним(і мейні створити
    об * єкт, задати значення для всіх полів, вивести на екран.)
    */




    /*
    Завдання 2. Реалізувати структуру «Праска»(фірма,
    модель, колір, мінімальна температура, максимальна
    температура, подача пари так / ні, потужність).Створіть
    екземпляр структури і проілюструйте роботу з ним.
    */
    




    /*
    Завдання 3. Реалізувати структуру «Бойлер»(фірма,
    колір, потужність, обсяг, температура нагріву).Створіть
    екземпляр структури і проілюструйте роботу з ним.
    */





    Додаткове завдання на додаткові 12 балів
    /*
    Завдання 4
    Реалізувати структуру "Машина" (колір, модель, номер).Номер машини може бути
    або п'ятизначним номером, або словом до 8 символів.
    Рекомендації: номер реалізувати як об'єднання.
    Створити екземпляр структури "Машина" і реалізувати для нього такі функції :
    Заповнення машини;
    Друк машини.
    Створити масив із 10 екземплярів структури "Машина" і реалізувати для нього такі функції :
    Редагувати машину;
    Друк усіх машин;
    Пошук машини за номером.
    */
}
